app/Controllers/Api/Auth.php

    public function requestOtp()
    {
        $payload = $this->request->getJSON(true) ?? $this->request->getPost();
        $mobile  = trim((string) ($payload['mobile'] ?? ''));

        if ($mobile === '') {
            return $this->failValidationErrors([
                'mobile' => 'Mobile number is required.',
            ]);
        }

        $response = $this->callApi([
            'funName' => 'requestOTP',
            'app_id'  => $this->appId,
            'mobile'  => $mobile,
        ]);

        if (! isset($response->response)) {
            return $this->fail('Unable to reach OTP server.');
        }

        $userModel    = model(UserModel::class);
        $user         = $userModel->where('mobile', $mobile)->first();
---
SELECT *
FROM `user`
WHERE `mobile` = '0766001459'
 LIMIT 1