app/Controllers/Api/BotMessages.php

SELECT *
FROM `bot_messages`
WHERE `bot_id` = 'b6d6ce5acb9a9948f945374e29ed663e'
ORDER BY `id` ASC
---
    public function index(string $botId)
    {
        if (! $this->currentUserId()) {
            return $this->failUnauthorized('Please log in first.');
        }

        $bot = $this->fetchBotForUser($botId);
        if (! $bot) {
            return $this->failNotFound('Bot not found.');
        }

        $messages = model(BotMessageModel::class)
            ->where('bot_id', $botId)
            ->orderBy('id', 'ASC')
            ->findAll();

SELECT *
FROM `bots`
WHERE `user_id` = '56697f681d7715b2840cc5f223750a5d'
AND `status` = 'active'
AND `bots`.`id` = 'b6d6ce5acb9a9948f945374e29ed663e'
---
    private function fetchBotForUser(string $id): ?array
    {
        $userId = $this->currentUserId();
        if (! $userId) {
            return null;
        }

        return model(BotModel::class)
            ->where('user_id', $userId)
            ->where('status', 'active')
            ->find($id);