app/Controllers/Api/Bots.php

SELECT *
FROM `bots`
WHERE `user_id` = '56697f681d7715b2840cc5f223750a5d'
AND `status` = 'active'
ORDER BY `created_at` DESC
---
    public function index()
    {
        $userId = $this->currentUserId();
        if (! $userId) {
            return $this->failUnauthorized('Please log in first.');
        }

        $bots = model(BotModel::class)
            ->where('user_id', $userId)
            ->where('status', 'active')
            ->orderBy('created_at', 'DESC')
            ->findAll();

SELECT *
FROM `documents`
WHERE `id` IN ('6441743639940e8ddbc4a99a9a2b984d','82f4d5bb3477ac575b10c01da84a5930','cded334cd7a544a4138ff1942ceb6e77')
---
    private function loadDocumentsForBots(array $bots): array
    {
        $ids = array_values(array_unique(array_filter(array_map(
            fn ($bot) => $bot['document_id'] ?? null,
            $bots
        ))));

        if ($ids === []) {
            return [];
        }

        $documents = model(DocumentModel::class)
            ->whereIn('id', $ids)
            ->findAll();