app/Controllers/Api/Documents.php

    public function index()
    {
        $userId = $this->currentUserId();
        if (! $userId) {
            return $this->failUnauthorized('Please log in first.');
        }

        $updatedAfter = $this->request->getGet('updated_after');

        $model = model(DocumentModel::class)
            ->where('user_id', $userId)
            ->where('status !=', 'archived');

        if ($updatedAfter) {
            $model->where('updated_at >', $updatedAfter);
        }

        $documents = $model->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `documents`
WHERE `user_id` = '56697f681d7715b2840cc5f223750a5d'
AND `status` != 'archived'
ORDER BY `created_at` DESC