app/Controllers/Api/Folders.php

    public function index()
    {
        $userId = $this->currentUserId();
        if (! $userId) {
            return $this->failUnauthorized('Please log in first.');
        }

        $folders = model(FolderModel::class)
            ->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `folders`
WHERE `user_id` = '56697f681d7715b2840cc5f223750a5d'
ORDER BY `created_at` DESC

    public function delete(string $id)
    {
        $folder = $this->fetchFolderForUser($id);
        if ($folder === null) {
            return $this->failNotFound('Folder not found.');
        }

        model(FolderModel::class)->delete($id);
---
DELETE FROM `folders`
WHERE `id` IN ('f52f35cad3f7ca2d1069e696')

    private function fetchFolderForUser(string $id): ?array
    {
        $userId = $this->currentUserId();
        if (! $userId) {
            return null;
        }

        return model(FolderModel::class)
            ->where('user_id', $userId)
            ->find($id);
---
SELECT *
FROM `folders`
WHERE `user_id` = '56697f681d7715b2840cc5f223750a5d'
AND `folders`.`id` = 'f52f35cad3f7ca2d1069e696'