app/Controllers/Api/GeneralChat.php

    public function index()
    {
        $userId = $this->currentUserId();
        if (! $userId) {
            return $this->failUnauthorized('Please log in first.');
        }

        $messages = model(GeneralChatMessageModel::class)
            ->where('user_id', $userId)
            ->orderBy('id', 'ASC')
            ->findAll();
---
SELECT *
FROM `general_chat_messages`
WHERE `user_id` = '56697f681d7715b2840cc5f223750a5d'
ORDER BY `id` ASC

    public function create()
    {
        $userId = $this->currentUserId();
        if (! $userId) {
            return $this->failUnauthorized('Please log in first.');
        }

        $payload = $this->request->getJSON(true) ?? $this->request->getPost();
        $role    = $payload['role'] ?? 'user';
        $type    = $payload['type'] ?? 'text';
        $content = trim((string) ($payload['content'] ?? ''));

        if ($content === '') {
            return $this->failValidationErrors(['content' => 'Message cannot be empty.']);
        }

        if (! in_array($role, ['user', 'assistant'], true)) {
            return $this->failValidationErrors(['role' => 'Role must be user or assistant.']);
        }

        if (! in_array($type, ['text', 'image'], true)) {
            return $this->failValidationErrors(['type' => 'Type must be text or image.']);
        }

        $model = model(GeneralChatMessageModel::class);
        $id = $model->insert([
            'user_id'    => $userId,
            'role'       => $role,
            'type'       => $type,
            'content'    => $content,
            'image_path' => $payload['image_path'] ?? null,
            'created_at' => date('Y-m-d H:i:s'),
        ], true);
---
INSERT INTO `general_chat_messages` (`user_id`, `role`, `type`, `content`, `image_path`, `created_at`) VALUES ('56697f681d7715b2840cc5f223750a5d', 'user', 'text', 'How are 😋', NULL, '2025-10-27 10:33:38')